---
kind: property
id: P:Autodesk.Revit.DB.STLExportOptions.ExportBinary
source: html/4593d7b6-ba1e-f90f-2c40-20a1393d8abb.htm
---
# Autodesk.Revit.DB.STLExportOptions.ExportBinary Property

True to export in binary STL format, false to export in ASCII STL format.
 Default value is true.

## Syntax (C#)
```csharp
public bool ExportBinary { get; set; }
```